const mapping = {
  ageMap: {
    0: '年龄不详',
    1: '0-3个月',
    2: '4-6个月',
    3: '7-16个月',
    4: '1岁',
    5: '2岁',
    6: '3岁',
    7: '4岁',
    8: '5岁及以上'
  },

  sexMap: {
    0: '性别不详',
    1: '男孩',
    2: '女孩'
  },

  hairMap: {
    0: '无毛',
    1: '短毛猫',
    2: '长毛猫'
  },

  vaccineMap: {
    0: '疫苗不详',
    1: '未免疫',
    2: '已免疫'
  },

  spayMap: {
    0: '绝育不详',
    1: '未绝育',
    2: '已绝育'
  },

  declawMap: {
    0: '驱虫不详',
    1: '未驱虫',
    2: '已驱虫'
  },

  sourceMap: {
    0: '家养',
    1: '救助站',
    2: '个人救助'
  }
}


module.exports = mapping;